---
type: AreaReinforcementType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# AreaReinforcementType

`Autodesk.Revit.DB.Structure.AreaReinforcementType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefaultAreaReinforcementType | 2015 | `public static ElementId CreateDefaultAreaReinforcementType ( Document aDoc )` |
| Property | Parameter | — | `` |